Beghein1992/0.orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 950;

boundaryField
{
    fixedWalls
    {
        type            zeroGradient;
    }

    leftside
    {
        type            fixedValue;
        value           uniform 900.;
    }

    rightside
    {
        type            fixedValue;
        value           uniform 1000.;
    }

}


// ************************************************************************* //
