Beghein1992/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 75.;

boundaryField
{
    fixedWalls
    {
        type            zeroGradient;
    }
    rightside
    {
        type            fixedValue;
        value           uniform 50.;
    }
    leftside
    {
        type            fixedValue;
        value           uniform 100.;
    }

}


// ************************************************************************* //
