Beghein1992/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gammaC		1e-4;
betaC		7.1e-8;
CRef 		950.;

transportModel Newtonian;

// Laminar viscosity
nu              71e-6;

// Thermal expansion coefficient
beta            14.2e-8;

// Reference temperature
TRef            75.;

// Laminar Prandtl number
Pr              0.71;

// Turbulent Prandtl number
Prt             1.0;

// ************************************************************************* //
