Beghein1992/system/funkySetFieldsDict
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          funkySetFieldsDict;
}

expressions
(
	initPressure
	{
		field p;
		expression "997.87 * (1. - pos().y) * 9.81 - 997.87 * 1. * 9.81";
		condition "(pos().y<1.) && (pos().y>0)";
	}
);
